# Задача 19.
# Поменяйте значения переменных местами.

# Исходные значения переменных.
a = 5
b = 10

print('Задача 19, решение:\n')

# Вывод значений до обмена.
print("До обмена:")
print("a =", a)
print("b =", b)

# Обмен значениями.
a, b = b, a

# Вывод значений после обмена.
print("После обмена:")
print("a =", a)
print("b =", b)